In [1]:
import os
import pandas as pd

jpath = os.path.join
BASEDIR = '/home/leon/projects/adin_2022/'

In [5]:
data_df = pd.read_csv(jpath(BASEDIR, '_files/people_raw.csv'))
data_df

,class,type,name,id_type,id_number,last_name,legal_type
0,Person_Natural,0,León,0,6108014,Corkidi Tzuckerman,-9999
1,Person_Natural,0,Yehiel,0,1130668637,Corkidi Tzuckerman,-9999
2,Person_Legal,1,Coragro,1,800219204,NaN,0
3,Person_Natural,0,Alberto,0,19245383,Corkidi Yaffe,-9999
4,Person_Natural,0,Isidoro,0,19128434,Corkidi Yaffe,-9999
...,...,...,...,...,...,...,...
86,Person_Natural,0,Alexandra,0,66679566,Mena Lopez,-9999
87,Person_Natural,0,Cynthia,0,52695485,Dixon Palau,-9999
88,Person_Natural,0,Jacqueline,0,31889682,Lopez Sevillno,-9999
89,Person_Natural,0,Carlos Alberto,0,16761696,Sierro Murillo,-9999
90,Person_Natural,0,Esther,0,31520503,Tzuckerman Pellman,-9999

In [4]:
info_df = pd.read_json(jpath(BASEDIR, '_files/_raw_data_info.json'))
info_df

,Person_Natural,Person_Legal,Address
data_attrs,"[type, name, id_number, id_type, last_name]","[type, name, id_number, id_type, legal_type]","[type, name, id_number, id_type, legal_type]"
relation_attrs,[],[],[]

In [6]:
def df2dj(df, di):
    objs = []
    for index, row in df.iterrows():
        obj = row['class']()
        for attr in di['data_attrs', row['class']]:
            if row[attr] not in [-9999, 'ZZZZZ']:
                setattr(obj, attr, row[attr])
        for attr in di['relation_attrs', row['class']]:
            if row[attr] not in [-9999, 'ZZZZZ']:
                setattr(obj, attr, row['class'].objects.get(pk={row[attr]}))
        objs.append(obj)
    return objs